## ✅ Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.images will be created
  + resource "google_artifact_registry_repository" "images" {
      + create_time      = (known after apply)
      + description      = "Docker images for Lumineer services"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "lumineer-ai"
      + repository_id    = "lumineer-images"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_artifact_registry_repository_iam_member.gh_actions_artifact_writer will be created
  + resource "google_artifact_registry_repository_iam_member" "gh_actions_artifact_writer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "asia-northeast1"
      + member     = (known after apply)
      + project    = "lumineer-ai"
      + repository = "lumineer-images"
      + role       = "roles/artifactregistry.writer"
    }

  # google_cloud_run_v2_service.ai will be created
  + resource "google_cloud_run_v2_service" "ai" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "lumineer-ai"
      + observed_generation     = (known after apply)
      + project                 = "lumineer-ai"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "asia-northeast1-docker.pkg.dev/lumineer-ai/lumineer-images/lumineer-ai:latest"

              + env {
                  + name  = "APP_ENV"
                  + value = "prod"
                }
              + env {
                  + name = "OPENAI_API_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "lumineer-openai-api-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "QDRANT_URL"
                  + value = (known after apply)
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 15
                  + period_seconds        = 30
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "2"
                      + "memory" = "2Gi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 20
                  + initial_delay_seconds = 10
                  + period_seconds        = 10
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }
        }
    }

  # google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "lumineer-api"
      + observed_generation     = (known after apply)
      + project                 = "lumineer-ai"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + annotations                      = (known after apply)
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "asia-northeast1-docker.pkg.dev/lumineer-ai/lumineer-images/lumineer-backend:latest"

              + env {
                  + name  = "APP_ENV"
                  + value = "prod"
                }
              + env {
                  + name  = "AI_PROCESSING_URL"
                  + value = (known after apply)
                }
              + env {
                  + name = "JWT_SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "lumineer-jwt-secret"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "DATABASE_URL"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "lumineer-database-url"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 5
                  + period_seconds        = 30
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 10
                  + initial_delay_seconds = 3
                  + period_seconds        = 5
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }
            }

          + scaling {
              + max_instance_count = 3
              + min_instance_count = 0
            }
        }
    }

  # google_cloud_run_v2_service.gateway will be created
  + resource "google_cloud_run_v2_service" "gateway" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "lumineer-gateway"
      + observed_generation     = (known after apply)
      + project                 = "lumineer-ai"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "asia-northeast1-docker.pkg.dev/lumineer-ai/lumineer-images/lumineer-gateway:latest"

              + env {
                  + name  = "APP_ENV"
                  + value = "prod"
                }
              + env {
                  + name  = "BACKEND_URL"
                  + value = (known after apply)
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 3
                  + period_seconds        = 30
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "256Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 10
                  + initial_delay_seconds = 2
                  + period_seconds        = 5
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }
            }

          + scaling {
              + max_instance_count = 3
              + min_instance_count = 0
            }
        }
    }

  # google_cloud_run_v2_service_iam_member.api_invokes_ai will be created
  + resource "google_cloud_run_v2_service_iam_member" "api_invokes_ai" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = (known after apply)
      + name     = "lumineer-ai"
      + project  = "lumineer-ai"
      + role     = "roles/run.invoker"
    }

  # google_cloud_run_v2_service_iam_member.api_public will be created
  + resource "google_cloud_run_v2_service_iam_member" "api_public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "lumineer-api"
      + project  = "lumineer-ai"
      + role     = "roles/run.invoker"
    }

  # google_cloud_run_v2_service_iam_member.gateway_invokes_api will be created
  + resource "google_cloud_run_v2_service_iam_member" "gateway_invokes_api" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = (known after apply)
      + name     = "lumineer-api"
      + project  = "lumineer-ai"
      + role     = "roles/run.invoker"
    }

  # google_cloud_run_v2_service_iam_member.gateway_public will be created
  + resource "google_cloud_run_v2_service_iam_member" "gateway_public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "lumineer-gateway"
      + project  = "lumineer-ai"
      + role     = "roles/run.invoker"
    }

  # google_cloud_run_v2_service_iam_member.gh_actions_deploy_ai will be created
  + resource "google_cloud_run_v2_service_iam_member" "gh_actions_deploy_ai" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = (known after apply)
      + name     = "lumineer-ai"
      + project  = "lumineer-ai"
      + role     = "roles/run.developer"
    }

  # google_cloud_run_v2_service_iam_member.gh_actions_deploy_api will be created
  + resource "google_cloud_run_v2_service_iam_member" "gh_actions_deploy_api" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = (known after apply)
      + name     = "lumineer-api"
      + project  = "lumineer-ai"
      + role     = "roles/run.developer"
    }

  # google_cloud_run_v2_service_iam_member.gh_actions_deploy_gateway will be created
  + resource "google_cloud_run_v2_service_iam_member" "gh_actions_deploy_gateway" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = (known after apply)
      + name     = "lumineer-gateway"
      + project  = "lumineer-ai"
      + role     = "roles/run.developer"
    }

  # google_compute_address.qdrant will be created
  + resource "google_compute_address" "qdrant" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "lumineer-qdrant-ip"
      + network_tier       = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "lumineer-ai"
      + purpose            = (known after apply)
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + terraform_labels   = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_firewall.qdrant will be created
  + resource "google_compute_firewall" "qdrant" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "lumineer-allow-qdrant"
      + network            = "default"
      + priority           = 1000
      + project            = "lumineer-ai"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "qdrant",
        ]

      + allow {
          + ports    = [
              + "6333",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.qdrant will be created
  + resource "google_compute_instance" "qdrant" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + effective_labels          = (known after apply)
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-micro"
      + metadata_fingerprint      = (known after apply)
      + metadata_startup_script   = <<-EOT
            #!/bin/bash
            set -e
            
            # Skip if Qdrant is already running
            if docker ps --format '{{.Names}}' | grep -q qdrant; then
              echo "Qdrant already running, skipping setup"
              exit 0
            fi
            
            # Install Docker
            apt-get update
            apt-get install -y docker.io
            systemctl enable docker
            systemctl start docker
            
            # Create persistent data directory
            mkdir -p /var/lib/qdrant/storage
            
            # Run Qdrant (no API key — firewall-protected, public course data)
            docker run -d --restart=always \
              --name qdrant \
              -p 6333:6333 \
              -v /var/lib/qdrant/storage:/qdrant/storage \
              qdrant/qdrant:v1.13.2
        EOT
      + min_cpu_platform          = (known after apply)
      + name                      = "lumineer-qdrant"
      + project                   = "lumineer-ai"
      + self_link                 = (known after apply)
      + tags                      = [
          + "qdrant",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = (known after apply)
      + zone                      = "asia-northeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "debian-cloud/debian-12"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = 20
              + type                   = "pd-standard"
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring.write",
            ]
        }
    }

  # google_firebase_hosting_site.frontend will be created
  + resource "google_firebase_hosting_site" "frontend" {
      + default_url = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "lumineer-ai"
      + site_id     = "lumineer-frontend"
    }

  # google_iam_workload_identity_pool.github will be created
  + resource "google_iam_workload_identity_pool" "github" {
      + description               = "Keyless auth for GitHub Actions"
      + display_name              = "GitHub Actions Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "lumineer-ai"
      + state                     = (known after apply)
      + workload_identity_pool_id = "lumineer-github-pool"
    }

  # google_iam_workload_identity_pool_provider.github will be created
  + resource "google_iam_workload_identity_pool_provider" "github" {
      + attribute_condition                = "assertion.repository == 'nakamu12/lumineer'"
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + display_name                       = "GitHub Actions Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "lumineer-ai"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "lumineer-github-pool"
      + workload_identity_pool_provider_id = "github-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # google_project_iam_member.api_cloudsql_client will be created
  + resource "google_project_iam_member" "api_cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "lumineer-ai"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.gh_actions_firebase_admin will be created
  + resource "google_project_iam_member" "gh_actions_firebase_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "lumineer-ai"
      + role    = "roles/firebasehosting.admin"
    }

  # google_project_service.compute will be created
  + resource "google_project_service" "compute" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.services["firebase.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "firebase.googleapis.com"
    }

  # google_project_service.services["firebasehosting.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "firebasehosting.googleapis.com"
    }

  # google_project_service.services["iam.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.services["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "iamcredentials.googleapis.com"
    }

  # google_project_service.services["run.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "run.googleapis.com"
    }

  # google_project_service.services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "secretmanager.googleapis.com"
    }

  # google_project_service.services["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "sqladmin.googleapis.com"
    }

  # google_project_service.services["sts.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "lumineer-ai"
      + service            = "sts.googleapis.com"
    }

  # google_secret_manager_secret.app_secrets["jwt_secret"] will be created
  + resource "google_secret_manager_secret" "app_secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app" = "lumineer"
          + "env" = "prod"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app" = "lumineer"
          + "env" = "prod"
        }
      + name                  = (known after apply)
      + project               = "lumineer-ai"
      + secret_id             = "lumineer-jwt-secret"
      + terraform_labels      = {
          + "app" = "lumineer"
          + "env" = "prod"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.app_secrets["openai_api_key"] will be created
  + resource "google_secret_manager_secret" "app_secrets" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app" = "lumineer"
          + "env" = "prod"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app" = "lumineer"
          + "env" = "prod"
        }
      + name                  = (known after apply)
      + project               = "lumineer-ai"
      + secret_id             = "lumineer-openai-api-key"
      + terraform_labels      = {
          + "app" = "lumineer"
          + "env" = "prod"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.database_url will be created
  + resource "google_secret_manager_secret" "database_url" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "app" = "lumineer"
          + "env" = "prod"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "app" = "lumineer"
          + "env" = "prod"
        }
      + name                  = (known after apply)
      + project               = "lumineer-ai"
      + secret_id             = "lumineer-database-url"
      + terraform_labels      = {
          + "app" = "lumineer"
          + "env" = "prod"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.ai_reads_openai_key will be created
  + resource "google_secret_manager_secret_iam_member" "ai_reads_openai_key" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "lumineer-openai-api-key"
    }

  # google_secret_manager_secret_iam_member.api_reads_database_url will be created
  + resource "google_secret_manager_secret_iam_member" "api_reads_database_url" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "lumineer-database-url"
    }

  # google_secret_manager_secret_iam_member.api_reads_jwt_secret will be created
  + resource "google_secret_manager_secret_iam_member" "api_reads_jwt_secret" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "lumineer-jwt-secret"
    }

  # google_secret_manager_secret_version.database_url will be created
  + resource "google_secret_manager_secret_version" "database_url" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # google_service_account.cloud_run_ai will be created
  + resource "google_service_account" "cloud_run_ai" {
      + account_id   = "lumineer-ai-sa"
      + description  = "Service account for Cloud Run AI Processing (Python) service"
      + disabled     = false
      + display_name = "Lumineer AI Processing Cloud Run SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "lumineer-ai"
      + unique_id    = (known after apply)
    }

  # google_service_account.cloud_run_api will be created
  + resource "google_service_account" "cloud_run_api" {
      + account_id   = "lumineer-api-sa"
      + description  = "Service account for Cloud Run API (Hono) service"
      + disabled     = false
      + display_name = "Lumineer API Cloud Run SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "lumineer-ai"
      + unique_id    = (known after apply)
    }

  # google_service_account.cloud_run_gateway will be created
  + resource "google_service_account" "cloud_run_gateway" {
      + account_id   = "lumineer-gw-sa"
      + description  = "Service account for Cloud Run Gateway (Hono) service"
      + disabled     = false
      + display_name = "Lumineer Gateway Cloud Run SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "lumineer-ai"
      + unique_id    = (known after apply)
    }

  # google_service_account.github_actions will be created
  + resource "google_service_account" "github_actions" {
      + account_id   = "lumineer-gh-actions-sa"
      + description  = "Service account for GitHub Actions CI/CD (deploy + push images)"
      + disabled     = false
      + display_name = "Lumineer GitHub Actions SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "lumineer-ai"
      + unique_id    = (known after apply)
    }

  # google_service_account.qdrant will be created
  + resource "google_service_account" "qdrant" {
      + account_id   = "lumineer-qdrant-sa"
      + description  = "Service account for GCE Qdrant instance (minimal permissions)"
      + disabled     = false
      + display_name = "Lumineer Qdrant GCE SA"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "lumineer-ai"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.gh_actions_act_as_ai_sa will be created
  + resource "google_service_account_iam_member" "gh_actions_act_as_ai_sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.gh_actions_act_as_api_sa will be created
  + resource "google_service_account_iam_member" "gh_actions_act_as_api_sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.gh_actions_act_as_gateway_sa will be created
  + resource "google_service_account_iam_member" "gh_actions_act_as_gateway_sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.gh_actions_workload_identity will be created
  + resource "google_service_account_iam_member" "gh_actions_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_sql_database.main will be created
  + resource "google_sql_database" "main" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "lumineer-db"
      + name            = "lumineer"
      + project         = "lumineer-ai"
      + self_link       = (known after apply)
    }

  # google_sql_database_instance.main will be created
  + resource "google_sql_database_instance" "main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_16"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "lumineer-db"
      + private_ip_address             = (known after apply)
      + project                        = "lumineer-ai"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = false
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)
            }

          + ip_configuration {
              + ipv4_enabled   = true
              + server_ca_mode = (known after apply)
              + ssl_mode       = (known after apply)
            }
        }
    }

  # google_sql_user.main will be created
  + resource "google_sql_user" "main" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "lumineer-db"
      + name                    = "lumineer"
      + password                = (sensitive value)
      + project                 = "lumineer-ai"
      + sql_server_user_details = (known after apply)
    }

  # random_password.db will be created
  + resource "random_password" "db" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # time_sleep.api_propagation will be created
  + resource "time_sleep" "api_propagation" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

Plan: 52 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ai_service_account_email       = (known after apply)
  + ai_service_url                 = (known after apply)
  + api_service_account_email      = (known after apply)
  + api_service_url                = (known after apply)
  + artifact_registry_url          = "asia-northeast1-docker.pkg.dev/lumineer-ai/lumineer-images"
  + cloudsql_connection_name       = (known after apply)
  + cloudsql_instance_name         = "lumineer-db"
  + firebase_hosting_url           = "https://lumineer-frontend.web.app"
  + gateway_service_account_email  = (known after apply)
  + gateway_service_url            = (known after apply)
  + github_actions_service_account = (known after apply)
  + qdrant_external_ip             = (known after apply)
  + qdrant_url                     = (known after apply)
  + secret_names                   = {
      + jwt_secret     = (known after apply)
      + openai_api_key = (known after apply)
    }
  + workload_identity_provider     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```